0xsmirk/mcu_cmsis_svd/Spansion/MB9BF51xN.svd
        <!-- REGISTER "SPSR" -->
        <register>
          <name>SPSR</name>
          <description>Special port setting register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0x15</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "USB0C" -->
            <field>
              <name>USB0C</name>
              <description>USBch0 pin setting bit</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MAINXC" -->
            <field>
              <name>MAINXC</name>
              <description>Main clock(oscillation) pin setting bit</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBXC" -->
            <field>
              <name>SUBXC</name>
              <description>Sub clock(oscillation) pin setting bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR00" -->
        <register>
          <name>EPFR00</name>
          <description>Extended pin function setting register 00</description>
          <addressOffset>0x600</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x30000</resetValue>
          <resetMask>0x30302F7</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRC1E" -->
            <field>
              <name>TRC1E</name>
              <description>TRACED function select bit1</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRC0E" -->
            <field>
              <name>TRC0E</name>
              <description>TRACED function select bit0</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN1S" -->
            <field>
              <name>JTAGEN1S</name>
              <description>JTAG function select bit1</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JTAGEN0B" -->
            <field>
              <name>JTAGEN0B</name>
              <description>JTAG function select bit0</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USBP0E" -->
            <field>
              <name>USBP0E</name>
              <description>USBch0 function select bit</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SUBOUTE" -->
            <field>
              <name>SUBOUTE</name>
              <description>Sub clock divide output function select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTCCOE" -->
            <field>
              <name>RTCCOE</name>
              <description>RTC clock output select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CROUTE" -->
            <field>
              <name>CROUTE</name>
              <description>Internal high-speed CR oscillation output function select bit</description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NMIS" -->
            <field>
              <name>NMIS</name>
              <description>NMIX function select bit</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR01" -->
        <register>
          <name>EPFR01</name>
          <description>Extended pin function setting register 01</description>
          <addressOffset>0x604</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IC03S" -->
            <field>
              <name>IC03S</name>
              <description>IC03 input select bit</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC02S" -->
            <field>
              <name>IC02S</name>
              <description>IC02 input select bit</description>
              <lsb>26</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC01S" -->
            <field>
              <name>IC01S</name>
              <description>IC01 input select bit</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC00S" -->
            <field>
              <name>IC00S</name>
              <description>IC00 input select bit</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRCK0S" -->
            <field>
              <name>FRCK0S</name>
              <description>FRCK0 input select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0S" -->
            <field>
              <name>DTTI0S</name>
              <description>DTTIX0 input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI0C" -->
            <field>
              <name>DTTI0C</name>
              <description>DTTIX0 function select bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO05E" -->
            <field>
              <name>RTO05E</name>
              <description>RTO05E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO04E" -->
            <field>
              <name>RTO04E</name>
              <description>RTO04E output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO03E" -->
            <field>
              <name>RTO03E</name>
              <description>RTO03E output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO02E" -->
            <field>
              <name>RTO02E</name>
              <description>RTO02E output select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO01E" -->
            <field>
              <name>RTO01E</name>
              <description>RTO01E output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO00E" -->
            <field>
              <name>RTO00E</name>
              <description>RTO00E output select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR02" -->
        <register>
          <name>EPFR02</name>
          <description>Extended pin function setting register 02</description>
          <addressOffset>0x608</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IC13S" -->
            <field>
              <name>IC13S</name>
              <description>IC13 input select bit</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC12S" -->
            <field>
              <name>IC12S</name>
              <description>IC12 input select bit</description>
              <lsb>26</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC11S" -->
            <field>
              <name>IC11S</name>
              <description>IC11 input select bit</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC10S" -->
            <field>
              <name>IC10S</name>
              <description>IC10 input select bit</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRCK1S" -->
            <field>
              <name>FRCK1S</name>
              <description>FRCK1 input select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI1S" -->
            <field>
              <name>DTTI1S</name>
              <description>DTTIX1 input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI1C" -->
            <field>
              <name>DTTI1C</name>
              <description>DTTIX1 function select bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO15E" -->
            <field>
              <name>RTO15E</name>
              <description>RTO15E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO14E" -->
            <field>
              <name>RTO14E</name>
              <description>RTO14E output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO13E" -->
            <field>
              <name>RTO13E</name>
              <description>RTO13E output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO12E" -->
            <field>
              <name>RTO12E</name>
              <description>RTO12E output select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO11E" -->
            <field>
              <name>RTO11E</name>
              <description>RTO11E output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO10E" -->
            <field>
              <name>RTO10E</name>
              <description>RTO10E output select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR03" -->
        <register>
          <name>EPFR03</name>
          <description>Extended pin function setting register 03</description>
          <addressOffset>0x60C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF1FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IC23S" -->
            <field>
              <name>IC23S</name>
              <description>IC23 input select bit</description>
              <lsb>29</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC22S" -->
            <field>
              <name>IC22S</name>
              <description>IC22 input select bit</description>
              <lsb>26</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC21S" -->
            <field>
              <name>IC21S</name>
              <description>IC21 input select bit</description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IC20S" -->
            <field>
              <name>IC20S</name>
              <description>IC20 input select bit</description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRCK2S" -->
            <field>
              <name>FRCK2S</name>
              <description>FRCK2 input select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI2S" -->
            <field>
              <name>DTTI2S</name>
              <description>DTTIX2 input select bit</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTTI2C" -->
            <field>
              <name>DTTI2C</name>
              <description>DTTIX2 function select bit</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO25E" -->
            <field>
              <name>RTO25E</name>
              <description>RTO25E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO24E" -->
            <field>
              <name>RTO24E</name>
              <description>RTO24E output select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO23E" -->
            <field>
              <name>RTO23E</name>
              <description>RTO23E output select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO22E" -->
            <field>
              <name>RTO22E</name>
              <description>RTO22E output select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO21E" -->
            <field>
              <name>RTO21E</name>
              <description>RTO21E output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTO20E" -->
            <field>
              <name>RTO20E</name>
              <description>RTO20E output select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR04" -->
        <register>
          <name>EPFR04</name>
          <description>Extended pin function setting register 04</description>
          <addressOffset>0x610</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB3S" -->
            <field>
              <name>TIOB3S</name>
              <description>TIOB3 input select bit</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3E" -->
            <field>
              <name>TIOA3E</name>
              <description>TIOA3E output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA3S" -->
            <field>
              <name>TIOA3S</name>
              <description>TIOA3 input select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB2S" -->
            <field>
              <name>TIOB2S</name>
              <description>TIOB2 input select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA2E" -->
            <field>
              <name>TIOA2E</name>
              <description>TIOA2 output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB1S" -->
            <field>
              <name>TIOB1S</name>
              <description>TIOB1 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1E" -->
            <field>
              <name>TIOA1E</name>
              <description>TIOA1E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA1S" -->
            <field>
              <name>TIOA1S</name>
              <description>TIOA1 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB0S" -->
            <field>
              <name>TIOB0S</name>
              <description>TIOB0 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA0E" -->
            <field>
              <name>TIOA0E</name>
              <description>TIOA0 output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR05" -->
        <register>
          <name>EPFR05</name>
          <description>Extended pin function setting register 05</description>
          <addressOffset>0x614</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F3C3F3C</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIOB7S" -->
            <field>
              <name>TIOB7S</name>
              <description>TIOB7 input select Bit</description>
              <lsb>28</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7E" -->
            <field>
              <name>TIOA7E</name>
              <description>TIOA7E output select bit</description>
              <lsb>26</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA7S" -->
            <field>
              <name>TIOA7S</name>
              <description>TIOA7 input select bit</description>
              <lsb>24</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB6S" -->
            <field>
              <name>TIOB6S</name>
              <description>TIOB6 input select bit</description>
              <lsb>20</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA6E" -->
            <field>
              <name>TIOA6E</name>
              <description>TIOA6 output select bit</description>
              <lsb>18</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB5S" -->
            <field>
              <name>TIOB5S</name>
              <description>TIOB5 input select bit</description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5E" -->
            <field>
              <name>TIOA5E</name>
              <description>TIOA5E output select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA5S" -->
            <field>
              <name>TIOA5S</name>
              <description>TIOA5 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOB4S" -->
            <field>
              <name>TIOB4S</name>
              <description>TIOB4 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIOA4E" -->
            <field>
              <name>TIOA4E</name>
              <description>TIOA4 output select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
